// Вызывается из правила Товары в Демо базе
Процедура ДобавитьСодержимоеДокументацииВВыборку(ЭтоПравило, ВыборкаВыгрузки, Параметры) Экспорт 
	// добавим содержимое файлов в выборку
	Для Каждого стрТовары Из ВыборкаВыгрузки.Строки Цикл
		спрОбъект = стрТовары.Ссылка.ПолучитьОбъект();
		поз = 0;
		Для Каждого стрДокументация из стрТовары.Строки Цикл
			ДвоичныеДанныеДокументация = спрОбъект.Документация[поз].ФайлСДокументацией.Получить();
			стрДокументация.СодержимоеФайла = Base64Строка(ДвоичныеДанныеДокументация);
			поз = поз + 1;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры